# Statistics

In [2]:
import pandas as pd 
df=pd.read_csv(r"C:\Resource\Sample data\global_people.csv")
df

      Name  Age           City      Country  Gender  Income_k
0    Alice   29       New York          USA  Female        65
1      Bob   34         London           UK    Male        58
2  Charlie   41        Toronto       Canada    Male        72
3    Diana   26         Sydney    Australia  Female        54
4    Ethan   38         Berlin      Germany    Male        68
5   Fatima   31          Dubai          UAE  Female        62
6   George   45  San Francisco          USA    Male        95
7     Hana   24          Seoul  South Korea  Female        48
8     Ivan   36         Moscow       Russia    Male        60
9    Julia   28          Paris       France  Female        57

In [3]:
df["Age"].max()

45

In [4]:
df["Age"].min()

24

In [5]:
df["Age"].mean()

np.float64(33.2)

In [6]:
df["Age"].describe()

count    10.000000
mean     33.200000
std       6.811755
min      24.000000
25%      28.250000
50%      32.500000
75%      37.500000
max      45.000000
Name: Age, dtype: float64

In [7]:
import pandas as pd
df[df.Age==df.Age.max()]

     Name  Age           City Country Gender  Income_k
6  George   45  San Francisco     USA   Male        95

In [8]:
df.count()

Name        10
Age         10
City        10
Country     10
Gender      10
Income_k    10
dtype: int64

In [9]:
df['City'].nunique()

10

In [10]:
df['City'].unique()

array(['New York', 'London', 'Toronto', 'Sydney', 'Berlin', 'Dubai',
       'San Francisco', 'Seoul', 'Moscow', 'Paris'], dtype=object)

In [11]:
df['City'].value_counts()

City
New York         1
London           1
Toronto          1
Sydney           1
Berlin           1
Dubai            1
San Francisco    1
Seoul            1
Moscow           1
Paris            1
Name: count, dtype: int64

## String Cleaning

In [12]:
df['City']=df['City'].str.upper()
df

      Name  Age           City      Country  Gender  Income_k
0    Alice   29       NEW YORK          USA  Female        65
1      Bob   34         LONDON           UK    Male        58
2  Charlie   41        TORONTO       Canada    Male        72
3    Diana   26         SYDNEY    Australia  Female        54
4    Ethan   38         BERLIN      Germany    Male        68
5   Fatima   31          DUBAI          UAE  Female        62
6   George   45  SAN FRANCISCO          USA    Male        95
7     Hana   24          SEOUL  South Korea  Female        48
8     Ivan   36         MOSCOW       Russia    Male        60
9    Julia   28          PARIS       France  Female        57

In [13]:
df['City']=df['City'].str.lower()
df

      Name  Age           City      Country  Gender  Income_k
0    Alice   29       new york          USA  Female        65
1      Bob   34         london           UK    Male        58
2  Charlie   41        toronto       Canada    Male        72
3    Diana   26         sydney    Australia  Female        54
4    Ethan   38         berlin      Germany    Male        68
5   Fatima   31          dubai          UAE  Female        62
6   George   45  san francisco          USA    Male        95
7     Hana   24          seoul  South Korea  Female        48
8     Ivan   36         moscow       Russia    Male        60
9    Julia   28          paris       France  Female        57

In [14]:
df['Name'].str.lower()

0      alice
1        bob
2    charlie
3      diana
4      ethan
5     fatima
6     george
7       hana
8       ivan
9      julia
Name: Name, dtype: object

In [16]:
df['City']=df['City'].str.replace("london","Manchester")
df

      Name  Age           City      Country  Gender  Income_k
0    Alice   29       new york          USA  Female        65
1      Bob   34     Manchester           UK    Male        58
2  Charlie   41        toronto       Canada    Male        72
3    Diana   26         sydney    Australia  Female        54
4    Ethan   38         berlin      Germany    Male        68
5   Fatima   31          dubai          UAE  Female        62
6   George   45  san francisco          USA    Male        95
7     Hana   24          seoul  South Korea  Female        48
8     Ivan   36         moscow       Russia    Male        60
9    Julia   28          paris       France  Female        57

## Concatenate DataFrames

In [17]:
india=pd.DataFrame({
    "city": ["Mumbai","Agra","Banglore"],
    "temp": [34,23,45]
})
india

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45

In [18]:
us=pd.DataFrame({
    "city": ["Chicago", "Newyork"," Ireland"],
    "temp": [45,23,67]
})
us

       city  temp
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [19]:
df=pd.concat([india,us])
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [20]:
df=pd.concat([india,us],ignore_index=True) # it gives line by line ignore index true means it follow ordered index
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
3   Chicago    45
4   Newyork    23
5   Ireland    67

In [21]:
df= pd.concat([india,us],axis=1) # it gives side by side tables
df

       city  temp      city  temp
0    Mumbai    34   Chicago    45
1      Agra    23   Newyork    23
2  Banglore    45   Ireland    67

## Merge dataframes

In [22]:
temp=pd.DataFrame({
    "city":["hyd","vzg","N"],
    "tempt":[34,45,67]
})
temp

  city  tempt
0  hyd     34
1  vzg     45
2    N     67

In [23]:
t=pd.DataFrame({
    "city":["hyd","vzg","vijy"],
    "rainfall":[36,55,77]
})
t

   city  rainfall
0   hyd        36
1   vzg        55
2  vijy        77

In [24]:
df=pd.merge(temp,t,on="city")  #it merges two datas and gives the common columns
df

  city  tempt  rainfall
0  hyd     34        36
1  vzg     45        55

In [25]:
df=pd.merge(temp,t,on="city",how="outer")  #it gives all with null values
df

   city  tempt  rainfall
0     N   67.0       NaN
1   hyd   34.0      36.0
2  vijy    NaN      77.0
3   vzg   45.0      55.0

In [26]:
df.isnull()

    city  tempt  rainfall
0  False  False      True
1  False  False     False
2  False   True     False
3  False  False     False

In [27]:
df.isnull().sum()

city        0
tempt       1
rainfall    1
dtype: int64

In [28]:
df["rainfall"]=df["rainfall"].fillna(df.rainfall.min())
df

   city  tempt  rainfall
0     N   67.0      36.0
1   hyd   34.0      36.0
2  vijy    NaN      77.0
3   vzg   45.0      55.0

In [29]:
df["tempt"]=df["tempt"].fillna(df.tempt.max())
df

   city  tempt  rainfall
0     N   67.0      36.0
1   hyd   34.0      36.0
2  vijy   67.0      77.0
3   vzg   45.0      55.0